export const Questions = [
  {
    id: 1,
    questionValue: "Я рідко втрачаю самоконтроль у стресових ситуаціях.",
  },
  {
    id: 2,
    questionValue: "Я швидко заспокоююсь після конфлікту.",
  },
  {
    id: 3,
    questionValue:
      "Мені вдається зберігати позитивний настрій навіть у важкі часи.",
  },
  {
    id: 4,
    questionValue: "Я не дозволяю емоціям повністю контролювати мої дії.",
  },
  {
    id: 5,
    questionValue: "Я можу приймати критику без образ.",
  },
  {
    id: 6,
    questionValue: "Я зазвичай розв’язую проблеми, не впадаючи в паніку.",
  },
  {
    id: 7,
    questionValue: "Я вмію висловлювати свої емоції спокійно та чітко.",
  },
  {
    id: 8,
    questionValue: "Мене важко вивести з рівноваги.",
  },
  {
    id: 9,
    questionValue:
      "Я здатен/здатна підтримувати інших, навіть коли сам(а) відчуваю емоційне напруження.",
  },
  {
    id: 10,
    questionValue: "Я рідко переживаю через речі, які не можу контролювати.",
  },
];
