export const answersResult = [
  {
    id: 1,
    range: [0, 10],
    result:
      "0-10 баллов:\n" +
      'Результат: "Низкий уровень эмоциональной устойчивости"\n' +
      "Вы часто испытываете трудности в стрессовых ситуациях и находитесь в состоянии тревожности. Это может указывать на необходимость развития навыков самоконтроля и эмоциональной устойчивости.",
  },
  {
    id: 2,
    range: [11, 20],
    result:
      "11-20 баллов:\n" +
      'Результат: "Нужно работать над эмоциональным балансом"\n' +
      "В стрессовых ситуациях вы можете терять самообладание, но есть потенциал для улучшения. Рекомендуется практиковать методы расслабления и стресса-менеджмента.",
  },
  {
    id: 3,
    range: [21, 30],
    result:
      "21-30 баллов:\n" +
      'Результат: "Средний уровень самоконтроля"\n' +
      "Вы способны справляться с большинством ситуаций, но порой испытываете трудности. Развивая навыки управления эмоциями, вы сможете стать более спокойным и уравновешенным человеком.",
  },
  {
    id: 4,
    range: [31, 40],
    result:
      "31-40 баллов:\n" +
      'Результат: "Высокий уровень эмоциональной устойчивости"\n' +
      "Вы хорошо справляетесь с эмоциями в стрессовых ситуациях, сохраняете спокойствие и можете легко восстанавливаться после конфликтов. Однако, есть еще место для совершенствования.",
  },
  {
    id: 5,
    range: [41, 50],
    result:
      "41-50 баллов:\n" +
      'Результат: "Отличная эмоциональная устойчивость"\n' +
      "Вы демонстрируете выдающуюся способность сохранять спокойствие и уверенность в самых стрессовых ситуациях. Ваши навыки самоконтроля и управления эмоциями являются примером для подражания!",
  },
];
